Repository: massidea/site
Catalog: application/languages/help.tmx
Source language: fi
Languages: en

source: Kirjaudu sisään
en: Login

source: rekisteröidy
en: sign up

source: tai
en: or

source: lisätäksesi sisältöä.
en: to add new content.

source: Apua
en: Help

source: Tietoja sivustosta
en: About

source: Miten rekisteröidä?
en: How to register?

source: Klikkaa "Rekisteröidy"-nappia oikeasta ylakulmasta. Täytä rekisteröintilomake ja klikkaa "Lähetä".
en: Click "Sign up" button from right upper corner. Enter your info and verif. text in pic. Click "I agree" and "Submit" buttons.

source: Kirjautuminen
en: Logging in

source: Klikkaa "Kirjaudu"-nappia oikeasta yläkulmasta. Kirjoita käyttäjänimi ja salasana omiin kenttiinsa. Klikkaa "Kirjaudu"-nappia.
en: Click "Login" button from right upper corner. Write your username and password to their fields. Press "Login" button under Submit button

source: Unohdin salasanani
en: I forgot my password

source: Klikkaa "Kirjaudu"-nappia oikeasta yläkulmasta. Klikkaa "Unohdin salasanani"-nappia. Jatka.
en: Click "Login" button from right upper corner. Click "I forgot my password" under "submit" button. Proceed.

source: Haku
en: Search

source: Kirjoita hakusana(t) haku-kenttään. Haku tehdään sisällön otsikkoon ja esittely osiin.
en: Write your search word(s) you want to search with to search-field. The search is done to topic and intodusion parts of contents.

source: Selaaminen
en: Browsing

source: Selataksesi sisältöä klikkaa jotain kolmesta napista haku-kentän yläpuolella. Silloin tulee toiset kolme ja "kaikki" napit haku-kentän alle. Sisällön voi järjestää otsikon, julkaisijan päivämäärän tai katsotuimpien mukaan.
en: To browse content you can click one of three content buttons over search-field. Then appears same three and "all" to under search-field.

source: Lisää sisältöä
en: Add content

source: Klikkaa "Lisää sisältöä" oikeasta yläkulmasta. Klikkaa linkkiä kuvassa. Valitse kysytyt asiat, ja ala kirjoittamaan sisältöä. Sivu kertoo jos et ole kirjoittanut tarpeeksi. Erota avainsanat pilkulla.
en: Click "Add content" from upper right corner. Click the link in picture. Choose the options and start writing the content. Page tells if you havent written enough. To use multiple keywords write ", " before next one.

source: Yksi kuumimmista talouden ja teknologian muutoksista on Web 2.0 perustuva Internetin sosiaaliset verkot, mikä viittaa nettiyhteisöihin ja ylläpidettyjen palvelu laitosten yhteistyöhön ja jakamiseen käyttäjien kesken. Siksi Avoin innovaatio pankki järjestelmä luotiin tukemaan Suomen kansallista innovaatiojärjestelmää. Järjestelmä on luotu avoimen lähdekoodin päälle, ja tehty tukemaan Googlen avointa API pohjaa ja/tai Facebook-alustaa.
en: One of the hottest economical and technological change driver at the moment seems to be the Web 2.0 based Online Social Networks (later OSN) movement which generally refers to communities and hosted services facilitating collaboration and sharing between users. Therefore in this research project we are proposing a new Open Innovation Bank System (OIBS) for supporting the Finnish national system of innovation (NIS). The system is created to support Google's newly launch OpenSocial APIs and Facebook platform.

source: Järjestelmä perustuu seuraavan kuvan mukaiseen innovaation kolmio kehyksen päälle. Ylin laatikko on idea pankki. Se sisältää kaksi täydentävää innovaation lähdettä: 1. Tulevaisuuden markkinatalouden pankki jonka teoreettisista perustuksista ja rakenteesta perustuu tulevaisuuden tutkimukselle ja 2. Nykyisien markkinataloudentietopankkiin, mikä on lukittu suuntautumaan asiakas/markkina tutkimuksen piiriin.
en: The OIBS is based on the Innovation Triangle framework (figure 1) which on the top idea bank includes two complementary innovation sources: 1) the future market environment information bank, which theoretical foundations and structure are based on future research and 2) the current market environment information bank, which is grounded on customer/market orientation research domain.

source: Näiden pankkien sisältö tuotetaan pääasiassa kahdella vastakkaisilla ryhmillä. Ensimmäinen ryhmä on nuoret (esim. yli sadalla tuhannella oppilaalla, jotka suorittavat alempaa korkeakoulututkintoaan) ja toinen iäkkäät ihmiset (esim. aktiiviset iäkkäämmät yhteisön jäsenet, jotka toimivat yhteiskunnan hyväksi tai tuottamattoman toiminnan organisaatioissa). Integroidaksemme tämän toiminnan Suomen alueellisen innovaatio politiikkaa malliimme, ja luodaksemme tukevan pohjan kanssakäymiselle näiden kolmen pankin välille, jolloin "Industry - innovation field matrix" (alan innovaatio aluematriisi) on määritelty.
en: The content for these banks will be produced mainly by two main opposite target group: the youth (i.e. over hundred thousand students performing their bachelor's degrees in the universities of applied sciences) and the aged (i.e. active members of ageing people community throughout the network of civic organizations and non-profit associations organizations). In order to integrate the Finnish regional innovation policy in to our model and create the solid interaction interface between the three defined banks, the common content classification schema based on industry - innovation field matrix is defined. In principal the industry dimension is based on the specific regional Centre of Expertise Programme (OSKE) while the innovation field is based on the innovation classifications defined in the literature. This classification will deepen our understating on the produced content profile while allocating the over hundred thousand worker resource efficiently. When the amount of content increases in the web service, one must provide intelligent services to end-users in order to create a solid user experience. As a result the intelligent combination of the following content recommendation approaches will be utilized: user preferences, content or user similarity to other users (i.e. collaboration). Together these individual functional components and the interaction interface between them are forming the overall functionalities, which we named as Open Innovation Bank System (OIBS).

source: Tuloksena mallin odotetaan lisäävän luovan yksilön dynamiikkaa luomalla internet ympäristön, jossa totutut tavat ylitetään helposti. yhteistuotanto ja älykäs sisällön suosittelu lähestymistavat nostavat huomattavasti mahdollisuuksia odottamattomiin löytöihin, jotka ovat suuri innovaation lähde. Pääsääntöisesti olemme integroineet kolmois kierteen ja sosiaalisen verkostoitumisen ideologiat uuteen malliin, jonka väitetään muokkaavan nykyistä käytäntöä yliopistoissa, yritysmaailmassa ja valtion välisissä vuorovaikutuksissa. Tuloksena konseptin ehdotuksesta tuoreet yliopisto-opiskelijat uusine ideoineen ja iäkkäät kansalaiset tärkeällä käytännön tiedollaan voivat tehokkaasti yhdistää voimavaransa avoimeen innovaation perustuvassa sosiaalisessa verkostoitumis yhteisössä.
en: As a result our model is expected to increase the dynamics of the individual's creativity by creating an online environment where a conventional habit is easily exceeded. The collaborative content production and intelligent content recommendation approach together will significantly boost the possibilities of unexpected findings which are a major innovation source. In this project we have defined, investigated and implemented a new people-to-people interaction based approach to support the national innovation system in Finland. In principal we have integrated the Triple Helix and the social networking ideologies in to a new model which is argued to change the current practice of university, industry, and government interaction. As a result of our concept suggestion the young university students with fresh ideas and the senior citizens with significant practical knowledge can effectively combine their forces in a open innovation based social networking community.

source: Tähtäämme myös onnistumistarinoiden kehittämiseen, joita voidaan käyttää nostamaan ali-hyödynnettyjä opiskelijoiden ja iäkkäiden kansalaisten luovuutta ja yhteistä vuorovaikutus resursseja pitääksemme Suomen kilpailuedun. Pää-asiakkaat tälle konseptille ovat yritykset, paikalliset auktoriteetit ja paikallinen hallinto. Nämä tekijät pääsevät käsiksi ei pelkästään laajaan ideapankkiin vaan tulevaisuuden markkinoille ympäristöön ja asiakkaiden tarve/ongelma tietoihin, joita päivitetään systemaattisesti. Koska tarjottavan tiedon laatu ja ymmärrettävyys ovat tärkeitä asiakkaille. He ovat valmiita maksamaan tästä pienen palvelumaksun. Kuitenkin, koska käyttö palvelumaksu on muutaman euron luokkaa kaupallista käyttäjää kohti kuukaudessa on mahdollisuus hyötyyn sama sekä pienillä, keskisuurilla että suurilla yrityksillä. Mitä kiinnostavimmin merkittävä osa syntyvistä tuloista jaetaan oppilaiden ja kansalaisten kesken, jotka ovat luoneet alkuperäisen sisällön. Optisimmassa tapahtumasarjassa opintotuen lisäksi, mitkä ovat yleisesti saatavissa yliopisto-oppilaille Suomessa, jonka lisäksi he saisivat maksun suorittaessaan normaaleja opintojaan. Toiselta kädeltä iäkkäät kansalaiset voivat parantaa rahallista statustaan, joka eläke-eksperttien mukaan jää tiedostamatta suurimmalta osalta tulevista eläkeläisistä.
en: The main aim in our project is to develop new commercial success stories and uplift the currently under-utilised student and senior citizen creativity and communal interaction resource as a sustaining national competitive advantage for Finland. The main customers for our concept are companies, local authorities and public administration. These actors will have an access not only to the extensive idea bank but also to the future market environment and customer need/problem information, which are systematically updated. Since the quality and the comprehensiveness of the provided information are valuable for our customers, they are willing to pay a small fee for this service. However, since the usage fee level is around few euros per commercial users per month the SMEs will now have the same possibilities to benefit from the service as larger organizations. Most interestingly the significant share of the generated revenues will be distributed to students and senior citizens who have created the original content. In the most optimistic scenario on the top of state study grants, which are generally available for University students in Finland, the students will be well paid when they perform their usual studies. On the other hand the senior citizens can uplift their financial status, which according to pension experts in general will fall into decline for the upcoming pensioners. The aim of the project is also to commercialization of the concept and technological solution by creating a new kind of educational format which can be exported.

source: [ Tarvitaan käännös ]
en: From the theoretical point of view the presented Open Innovation Bank System (OIBS) is an open source model for new emerging Online Social Networks. With our research project we have pointed out that OSNs can also play technologically and socially important role in the commercialization process of novel ideas and inventions. OSNs can support commercialization of new ideas, inventions and innovations in large scale. The new OIBS concept includes many interesting characters, both socially and technologically, which are worth to investigate. The researchers will have full access to the data bank export functionalities, which enables the empirical investigations of the produced content. In principal our three databases with extensive classification schema derived from innovation theories are representations of structured text databases as if they were equal to structured interview. In the future we expect that by the support of OSNs we can expect better success rates and wider involvement of social networks to commercialize novel ideas, inventions and innovations. The presented Open Innovation Bank System is one concrete and conceptual framework to implement new kind of open innovation policy in Finland as well as in other countries.

source: Where did the idea for massidea.org come from?
en: The original idea was invented by Dr. Teemu Santonen in autumn 2006. He was stimulated by a new academic working environment and realized that his previously identified practical need – how masses of people could generate ideas and innovations without causing significant extra costs – might be solved. Project planning and building up the consortium took place in spring 2007. Like in the case of most ideas, the project was not able to get funding at the first attempt. The Finnish Funding Agency for Technology and Innovation (Tekes) argued that the project plan as a whole is not credible and it does not include enough new standpoints. We hope that you’ll help us to prove them wrong. The second funding attempt was successful. Tentative financing decision came from European Social Fund (ESF) in spring 2008 and soon after that the project was awarded by the Finnish Inventor Support Association as the best school related innovation. Official funding decision reached the project group in January 2009 and first demo version was published in spring 2009. The second and current more improved site version was launch in November 2009. Massidea.org is now ready to generate smashing ideas or at least ready to smash ideas.

source: How massidea.org is working
en: In Massidea.org users upload/post short articles in three main categories: Today's challenges, Visions of the future and New ideas. Ideas are solutions to challenges or visions. Also, all articles are categorized All articles can be commented on, rated and further develope by anyone.

source: Vain rekisteröityneen käyttäjät voivat lähettää sisältöä.
en: Only registered users can submit content.

source: Tutustu näihin sisällön lisäämisen ohjeisiin jos olet uusi käyttäjä.
en: Familiarise yourself with these content production guidelines if you are a new user.

source: Sisällön lisäämisen ohjeet
en: Content production guidelines

source: Haasteet, visiot ja ratkaisut ovat aina erillisiä dokumetteja. Älä sekoita eri sisältöjä yhteen dokumenttiin. Tee vain yksi avainkohta dokumenttia kohde - jos on tarve useampaan näkökulmaan tai avainasiaan, tee niistä erilliset dokumentit ja linkitä yhteen myöhemmin. Tämän avulla mahdollistetaan saumaton linkitys ja onnekkaat oivallukset.
en: Challenges, visions and solutions are always kept on separate documents. Do not mix these together in a one document. Also present only one keypoint per uploaded content. If there is a need for multiple viewpoint, write separate documents and link them together later on. This procedure allows the seemless linkage between contents and enables lucky insights.

source: Mikä on haaste?
en: What is challenge?

source: Ongelmat ja esteet estävät meitä saavuttamasta päämääriämme. On kyse sitten omasta tai liike-elämästä, ongelmat voidaan kääntää haasteiksi ja aloittaa niiden ratkominen.
en: Challenge can be personal, business or social related problem, need, situation or observation description. It defines the current status of affairs and recognizes the need to resolve the matter. Challenges are important source for generating new ideas, since they are describing the current market needs.

source: Mikä on idea?
en: What is idea?

source: Ideat liittyvät aina haasteisiin tai visioihin Massidea.org:in tietokannassa. Toisin sanoin, ideat ovat vastauksia tai ratkaisuja nykyisiin haasteiisiin tai tulevaisuuden visioihin.
en: Ideas are solutions to today’s challenges and visions of the future related opportunities and threats. Idea is always the starting point, plan or intention for potential innovation. Idea can suggest small incremental improvement or radical revolutionary change in thinking, products, processes or organization.

source: Mikä on visio?
en: What is vision?

source: Visio koskee tulevaisuutta, ei tätä hetkeä. Kyseessä voi olla skenaario, trendi tai antitrendi, jonka odotetaan tulevan toteutuvan. Kyseessä voi olla myös muutoksen siemen tai heikko signaali, joka saattaa toteutua.
en: Vision concern the long-term future which is usually at least 10 years away. It can be future scenario, trend or anti-trend, which is most likely to be realized. It can also describe an alternative unlikely future based on seed of change or weak signal, which might significantly change all our life if realized.

source: Sisällön rakenne Kaikki sisällöt noudattavat seuraavaa formaattia. Otsikko (max. 120 merkkiä) Pääotsikko. Hyvä otsikko kuvaa koko sisältöä yhdessä lauseessa. Avainsanat/Tagit (max. 120 merkkiä, eroita toisistaan pilkulla) Erillisä sanoja jotka kuvaavat hyvin sisältöäsi. Avainsanot tulee valita harkiten, sillä niitä käytetään hakutuloksien muodostamisessa ja ne auttavat käyttäjiä löytämään sisältösi. Ingressi (max. 160 merkkiä) Lyhyt teksti, joka täydentää ja täsmentää otsikossa kerrottua aihetta. Ingressi esitetään aina otsikon kanssa, ei milloinkaan yksin. Leipäteksti (min. 1000, max. 4000 merkkiä) Pidä kirjoittamasi lyhyenä. Hyväksytty teksti on maksimikoossaankin alle yhden A4:n. Yhden otsikon alla tulee aina olla yksi näkemys asiasta - jos tarvitaan useita näkökantoja, kirjoita erilliset dokumentit ja linkitä ne yhteen. Jokainen sisältö tulee olla käyttökelpoinen myös yksin. Sisältötyypistä riippuen (haaste, visio tai idea) sisällössä pitää vastata alla oleviin kysymyksiin. Haaste: Mikä se on, miksi se on tärkeää ratkaista? Visio: Mikä se on, kuinka todennäköinen sen toteutuminen on? Idea: Mikä se on, miksi se tulee toimimaan? Kirjoita henkilölle, joka ei ennestään tunne aihetta. Älä odota liikaa lukijalta. Liittyvät organisaatiot (max. 120 merkkiä, eroita toisistaan pilkulla) Tunnista ainakin yksi asiaan liittyvä organisaatio. Kyseessä voi olla yhtiö, julkisen sektorin organsiaatio tai voittoa tavoittelematon organisaatio. Myös tämä auttaa muita löytämään sisältösi. Tee yhteenveto (max. 120 merkkiä Tee yhteenveto sisällöstä yhteen lauseeseen vastauksen muodossa: Haaste: Tutkimuskysymys, yksittäinen kysymys johon haluat vastauksen Visio: Tärkein mahdollisuus ja uhka, jos visio käy toteen. Idea: Ideasi tai ratkaisusi yhdessä lauseessa Yhteenvetoja käytetään Lucky insight -toiminnossa käyttäjien avustamiseen.
en: Content structure All contents in Massidea.org are following below format. Headline(max. length 120 char) Is the main title. A good headline describes in one sentece your whole story. Keywords/Tags(max. length 120 char, separate individual words with commas) Separate words that are describing well your content. Tags should be selected carefully, as they will determine the search results and help users to seek information. Caption(max. length 160 char) It is a a short text which complements and provides additional information to topic presented in the headline. Caption is always presented with headline, never alone. Text(min. length 1000 char and max length 4000 char) Keep your writing short. The accepted length is between 1/3 to one A4 (or US letter). Topic should always express a single point of view. If there is a need for multiple viewpoint, write separate documents and link them together. Each content must be readable alone. Depending on the content type (challenge, vision or idea) you must be able to answer these questions in your texts. Challenge: What is it and why it is important to solve it? Vision: What is it, when and how likely it is expected to be realized? Idea: What is it and why is it going to work? Write for a person who is not familiar with the topic. Do no assume to much from a reader. Related organizations(max. length 120 char, separate organizations with commas) Indentify at least one related organization. It can be a private company, a public sector organization or a non-profit organization. This also help others find your content. Summarize your content(max. length 120 char) Summarize enire content in one sentence by answering following questions: Challenge: Research question, the single question you want get an answer Vision: The most important opportunity and threat if future scenario becomes realized Idea: Your idea/solution in one sentence Summarized contents are used in the Lucky insight -application to stimulate users minds.

source: Kaipaatko lisätietoa? Yksityskohtaisemmat ohjeistukset löytyvät Massidea.org -sisällöntuottamisen tutoriaalista.
en: Do you need more information? For more detailed guidelines read Massidea.org - Content production tutorial.

source: Paranna mahdollisuuksiasi
en: Increase your changes

source: Erotu massasta Valitse mielenkiintoinen aihe ja ispiroi lukijaa kirjoituksellasi. Motivoi toisia tarjoamaan heidän näkemyksensä aiheestasi. Varmista, että sisältösi löydetään Otsikko, ingressi ja avainsanat ovat tärkeimmät, sillä ne määrittävät sekä kuinka vetoava artikkelisi on että löydetäänkö artikkelia. Valitse kielesi Jos haluat kansainvälisen yleisön, suosittelemme englantia. Voit kuitenkin kirjoittaa sisältösi millä tahansa kielellä.
en: Stand out from the mass Select an interesting topic and inspire reader with your writing. Motivate others to offer their viewpoints to your content. Ensure that your content is found Title, caption and keywords are most important, as they will determine how attractive your article is and whether others will find it. Choose your language If you want to reach a global audience, English is preferred. However, you can choosen to write in any language.
